name: "reranker"
backend: "python"
max_batch_size: 8

input [
  { name: "QUERIES"   data_type: TYPE_STRING dims: [1] }
  { name: "DOCUMENTS" data_type: TYPE_STRING dims: [1] }
  { name: "MODEL"     data_type: TYPE_STRING dims: [1] }  # "qwen" 或 "bge"
]

output [
  { name: "SCORES" data_type: TYPE_FP32 dims: [1] }
]

instance_group [
  { kind: KIND_GPU }
]